;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! srefactor)
(package! geiser)
(package! clojure-mode)
(package! cider)

(package! go-mode)
(package! lsp-mode)
(package! lsp-ui)
(package! company-lsp)

(package! elixir-mode)
(package! alchemist)

(package! tide)
(package! prettier-js)
;; Examples
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
